MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB406/mcu.h
#define IPC9 IPC9
extern volatile uint16_t IPC9 __attribute__((__sfr__));
__extension__ typedef struct tagIPC9BITS {
  union {
    struct {
      uint16_t DMA3IP:3;
      uint16_t :1;
      uint16_t IC3IP:3;
      uint16_t :1;
      uint16_t IC4IP:3;
      uint16_t :1;
      uint16_t IC5IP:3;
    };
    struct {
      uint16_t DMA3IP0:1;
      uint16_t DMA3IP1:1;
      uint16_t DMA3IP2:1;
      uint16_t :1;
      uint16_t IC3IP0:1;
      uint16_t IC3IP1:1;
      uint16_t IC3IP2:1;
      uint16_t :1;
      uint16_t IC4IP0:1;
      uint16_t IC4IP1:1;
      uint16_t IC4IP2:1;
      uint16_t :1;
      uint16_t IC5IP0:1;
      uint16_t IC5IP1:1;
      uint16_t IC5IP2:1;
    };
  };
} IPC9BITS;
extern volatile IPC9BITS IPC9bits __attribute__((__sfr__));

#define IPC10 IPC10
extern volatile uint16_t IPC10 __attribute__((__sfr__));
__extension__ typedef struct tagIPC10BITS {
  union {
    struct {
      uint16_t IC6IP:3;
      uint16_t :1;
      uint16_t OC5IP:3;
      uint16_t :1;
      uint16_t OC6IP:3;
      uint16_t :1;
      uint16_t CCT3IP:3;
    };
    struct {
      uint16_t IC6IP0:1;
      uint16_t IC6IP1:1;
      uint16_t IC6IP2:1;
      uint16_t :1;
      uint16_t OC5IP0:1;
      uint16_t OC5IP1:1;
      uint16_t OC5IP2:1;
      uint16_t :1;
      uint16_t OC6IP0:1;
      uint16_t OC6IP1:1;
      uint16_t OC6IP2:1;
      uint16_t :1;
      uint16_t CCT3IP0:1;
      uint16_t CCT3IP1:1;
      uint16_t CCT3IP2:1;
    };
  };
} IPC10BITS;
extern volatile IPC10BITS IPC10bits __attribute__((__sfr__));

#define IPC11 IPC11
extern volatile uint16_t IPC11 __attribute__((__sfr__));
__extension__ typedef struct tagIPC11BITS {
  union {
    struct {
      uint16_t CCT4IP:3;
      uint16_t :1;
      uint16_t PMPIP:3;
      uint16_t :1;
      uint16_t DMA4IP:3;
      uint16_t :1;
      uint16_t CCT5IP:3;
    };
    struct {
      uint16_t CCT4IP0:1;
      uint16_t CCT4IP1:1;
      uint16_t CCT4IP2:1;
      uint16_t :1;
      uint16_t PMPIP0:1;
      uint16_t PMPIP1:1;
      uint16_t PMPIP2:1;
      uint16_t :1;
      uint16_t DMA4IP0:1;
      uint16_t DMA4IP1:1;
      uint16_t DMA4IP2:1;
      uint16_t :1;
      uint16_t CCT5IP0:1;
      uint16_t CCT5IP1:1;
      uint16_t CCT5IP2:1;
    };
  };
} IPC11BITS;
extern volatile IPC11BITS IPC11bits __attribute__((__sfr__));

#define IPC12 IPC12
extern volatile uint16_t IPC12 __attribute__((__sfr__));
__extension__ typedef struct tagIPC12BITS {
  union {
    struct {
      uint16_t CCT6IP:3;
      uint16_t :1;
      uint16_t SI2C2IP:3;
      uint16_t :1;
      uint16_t MI2C2IP:3;
      uint16_t :1;
      uint16_t CCT7IP:3;
    };
    struct {
      uint16_t CCT6IP0:1;
      uint16_t CCT6IP1:1;
      uint16_t CCT6IP2:1;
      uint16_t :1;
      uint16_t SI2C2IP0:1;
      uint16_t SI2C2IP1:1;
      uint16_t SI2C2IP2:1;
      uint16_t :1;
      uint16_t MI2C2IP0:1;
      uint16_t MI2C2IP1:1;
      uint16_t MI2C2IP2:1;
      uint16_t :1;
      uint16_t CCT7IP0:1;
      uint16_t CCT7IP1:1;
      uint16_t CCT7IP2:1;
    };
  };
} IPC12BITS;
extern volatile IPC12BITS IPC12bits __attribute__((__sfr__));

#define IPC13 IPC13
extern volatile uint16_t IPC13 __attribute__((__sfr__));
__extension__ typedef struct tagIPC13BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t INT3IP:3;
      uint16_t :1;
      uint16_t INT4IP:3;
      uint16_t :1;
      uint16_t CRYDNIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t INT3IP0:1;
      uint16_t INT3IP1:1;
      uint16_t INT3IP2:1;
      uint16_t :1;
      uint16_t INT4IP0:1;
      uint16_t INT4IP1:1;
      uint16_t INT4IP2:1;
      uint16_t :1;
      uint16_t CRYDNIP0:1;
      uint16_t CRYDNIP1:1;
      uint16_t CRYDNIP2:1;
    };
  };
} IPC13BITS;
extern volatile IPC13BITS IPC13bits __attribute__((__sfr__));

#define IPC14 IPC14
extern volatile uint16_t IPC14 __attribute__((__sfr__));
__extension__ typedef struct tagIPC14BITS {
  union {
    struct {
      uint16_t KEYSTRIP:3;
      uint16_t :1;
      uint16_t SPI4RXIP:3;
      uint16_t :1;
      uint16_t SPI1RXIP:3;
      uint16_t :1;
      uint16_t SPI2RXIP:3;
    };
    struct {
      uint16_t KEYSTRIP0:1;
      uint16_t KEYSTRIP1:1;
      uint16_t KEYSTRIP2:1;
      uint16_t :1;
      uint16_t SPI4RXIP0:1;
      uint16_t SPI4RXIP1:1;
      uint16_t SPI4RXIP2:1;
      uint16_t :1;
      uint16_t SPI1RXIP0:1;
      uint16_t SPI1RXIP1:1;
      uint16_t SPI1RXIP2:1;
      uint16_t :1;
      uint16_t SPI2RXIP0:1;
      uint16_t SPI2RXIP1:1;
      uint16_t SPI2RXIP2:1;
    };
  };
} IPC14BITS;
extern volatile IPC14BITS IPC14bits __attribute__((__sfr__));

#define IPC15 IPC15
extern volatile uint16_t IPC15 __attribute__((__sfr__));
__extension__ typedef struct tagIPC15BITS {
  union {
    struct {
      uint16_t SPI3RXIP:3;
      uint16_t :1;
      uint16_t DMA5IP:3;
      uint16_t :1;
      uint16_t RTCIP:3;
      uint16_t :1;
      uint16_t CCP1IP:3;
    };
    struct {
      uint16_t SPI3RXIP0:1;
      uint16_t SPI3RXIP1:1;
      uint16_t SPI3RXIP2:1;
      uint16_t :1;
      uint16_t DMA5IP0:1;
      uint16_t DMA5IP1:1;
      uint16_t DMA5IP2:1;
      uint16_t :1;
      uint16_t RTCIP0:1;
      uint16_t RTCIP1:1;
      uint16_t RTCIP2:1;
      uint16_t :1;
      uint16_t CCP1IP0:1;
      uint16_t CCP1IP1:1;
      uint16_t CCP1IP2:1;
    };
  };
} IPC15BITS;
extern volatile IPC15BITS IPC15bits __attribute__((__sfr__));

#define IPC16 IPC16
extern volatile uint16_t IPC16 __attribute__((__sfr__));
__extension__ typedef struct tagIPC16BITS {
  union {
    struct {
      uint16_t CCP2IP:3;
      uint16_t :1;
      uint16_t U1ERIP:3;
      uint16_t :1;
      uint16_t U2ERIP:3;
      uint16_t :1;
      uint16_t CRCIP:3;
    };
    struct {
      uint16_t CCP2IP0:1;
      uint16_t CCP2IP1:1;
      uint16_t CCP2IP2:1;
      uint16_t :1;
      uint16_t U1ERIP0:1;
      uint16_t U1ERIP1:1;
      uint16_t U1ERIP2:1;
      uint16_t :1;
      uint16_t U2ERIP0:1;
      uint16_t U2ERIP1:1;
      uint16_t U2ERIP2:1;
      uint16_t :1;
      uint16_t CRCIP0:1;
      uint16_t CRCIP1:1;
      uint16_t CRCIP2:1;
    };
  };
} IPC16BITS;
