MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB406/mcu.h
extern volatile TIMEHBITS TIMEHbits __attribute__((__sfr__));

#define DATEL DATEL
extern volatile uint16_t DATEL __attribute__((__sfr__));
typedef struct tagDATELBITS {
  uint16_t WDAY:3;
  uint16_t :5;
  uint16_t DAYONE:4;
  uint16_t DAYTEN:2;
} DATELBITS;
extern volatile DATELBITS DATELbits __attribute__((__sfr__));

#define DATEH DATEH
extern volatile uint16_t DATEH __attribute__((__sfr__));
typedef struct tagDATEHBITS {
  uint16_t MTHONE:4;
  uint16_t MTHTEN:1;
  uint16_t :3;
  uint16_t YRONE:4;
  uint16_t YRTEN:4;
} DATEHBITS;
extern volatile DATEHBITS DATEHbits __attribute__((__sfr__));

#define ALMTIMEL ALMTIMEL
extern volatile uint16_t ALMTIMEL __attribute__((__sfr__));
typedef struct tagALMTIMELBITS {
  uint16_t :8;
  uint16_t SECONE:4;
  uint16_t SECTEN:3;
} ALMTIMELBITS;
extern volatile ALMTIMELBITS ALMTIMELbits __attribute__((__sfr__));

#define ALMTIMEH ALMTIMEH
extern volatile uint16_t ALMTIMEH __attribute__((__sfr__));
typedef struct tagALMTIMEHBITS {
  uint16_t MINONE:4;
  uint16_t MINTEN:3;
  uint16_t :1;
  uint16_t HRONE:4;
  uint16_t HRTEN:2;
} ALMTIMEHBITS;
extern volatile ALMTIMEHBITS ALMTIMEHbits __attribute__((__sfr__));

#define ALMDATEL ALMDATEL
extern volatile uint16_t ALMDATEL __attribute__((__sfr__));
typedef struct tagALMDATELBITS {
  uint16_t WDAY:3;
  uint16_t :5;
  uint16_t DAYONE:4;
  uint16_t DAYTEN:2;
} ALMDATELBITS;
extern volatile ALMDATELBITS ALMDATELbits __attribute__((__sfr__));

#define ALMDATEH ALMDATEH
extern volatile uint16_t ALMDATEH __attribute__((__sfr__));
typedef struct tagALMDATEHBITS {
  uint16_t MTHONE:4;
  uint16_t MTHTEN:1;
  uint16_t :3;
  uint16_t YRONE:4;
  uint16_t YRTEN:4;
} ALMDATEHBITS;
extern volatile ALMDATEHBITS ALMDATEHbits __attribute__((__sfr__));

#define TSATIMEL TSATIMEL
extern volatile uint16_t TSATIMEL __attribute__((__sfr__));
typedef struct tagTSATIMELBITS {
  uint16_t :8;
  uint16_t SECONE:4;
  uint16_t SECTEN:3;
} TSATIMELBITS;
extern volatile TSATIMELBITS TSATIMELbits __attribute__((__sfr__));

#define TSATIMEH TSATIMEH
extern volatile uint16_t TSATIMEH __attribute__((__sfr__));
typedef struct tagTSATIMEHBITS {
  uint16_t MINONE:4;
  uint16_t MINTEN:3;
  uint16_t :1;
  uint16_t HRONE:4;
  uint16_t HRTEN:2;
} TSATIMEHBITS;
extern volatile TSATIMEHBITS TSATIMEHbits __attribute__((__sfr__));

#define TSADATEL TSADATEL
extern volatile uint16_t TSADATEL __attribute__((__sfr__));
typedef struct tagTSADATELBITS {
  uint16_t WDAY:3;
  uint16_t :5;
  uint16_t DAYONE:4;
  uint16_t DAYTEN:2;
} TSADATELBITS;
extern volatile TSADATELBITS TSADATELbits __attribute__((__sfr__));

#define TSADATEH TSADATEH
extern volatile uint16_t TSADATEH __attribute__((__sfr__));
typedef struct tagTSADATEHBITS {
  uint16_t MTHONE:4;
  uint16_t MTHTEN:1;
  uint16_t :3;
  uint16_t YRONE:4;
  uint16_t YRTEN:4;
} TSADATEHBITS;
extern volatile TSADATEHBITS TSADATEHbits __attribute__((__sfr__));

#define TSBTIMEL TSBTIMEL
extern volatile uint16_t TSBTIMEL __attribute__((__sfr__));
typedef struct tagTSBTIMELBITS {
  uint16_t :8;
  uint16_t SECONE:4;
  uint16_t SECTEN:3;
} TSBTIMELBITS;
extern volatile TSBTIMELBITS TSBTIMELbits __attribute__((__sfr__));

#define TSBTIMEH TSBTIMEH
extern volatile uint16_t TSBTIMEH __attribute__((__sfr__));
typedef struct tagTSBTIMEHBITS {
  uint16_t MINONE:4;
  uint16_t MINTEN:3;
  uint16_t :1;
  uint16_t HRONE:4;
  uint16_t HRTEN:2;
} TSBTIMEHBITS;
extern volatile TSBTIMEHBITS TSBTIMEHbits __attribute__((__sfr__));

#define TSBDATEL TSBDATEL
extern volatile uint16_t TSBDATEL __attribute__((__sfr__));
typedef struct tagTSBDATELBITS {
  uint16_t WDAY:3;
  uint16_t :5;
  uint16_t DAYONE:4;
  uint16_t DAYTEN:2;
} TSBDATELBITS;
extern volatile TSBDATELBITS TSBDATELbits __attribute__((__sfr__));

#define TSBDATEH TSBDATEH
extern volatile uint16_t TSBDATEH __attribute__((__sfr__));
typedef struct tagTSBDATEHBITS {
  uint16_t MTHONE:4;
  uint16_t MTHTEN:1;
  uint16_t :3;
  uint16_t YRONE:4;
  uint16_t YRTEN:4;
} TSBDATEHBITS;
extern volatile TSBDATEHBITS TSBDATEHbits __attribute__((__sfr__));

#define IC1CON1 IC1CON1
extern volatile uint16_t IC1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC1CON1BITS {
  union {
    struct {
      uint16_t ICM:3;
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICI:2;
      uint16_t :3;
      uint16_t ICTSEL:3;
      uint16_t ICSIDL:1;
    };
    struct {
      uint16_t ICM0:1;
      uint16_t ICM1:1;
      uint16_t ICM2:1;
      uint16_t :2;
      uint16_t ICI0:1;
      uint16_t ICI1:1;
      uint16_t :3;
      uint16_t ICTSEL0:1;
      uint16_t ICTSEL1:1;
      uint16_t ICTSEL2:1;
    };
  };
} IC1CON1BITS;
extern volatile IC1CON1BITS IC1CON1bits __attribute__((__sfr__));

#define IC1CON2 IC1CON2
extern volatile uint16_t IC1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC1CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t :1;
      uint16_t TRIGSTAT:1;
      uint16_t ICTRIG:1;
      uint16_t IC32:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
    };
  };
} IC1CON2BITS;
extern volatile IC1CON2BITS IC1CON2bits __attribute__((__sfr__));


/* Generic structure of entire SFR area for Input Capture modules */
typedef struct tagIC {
        uint16_t icxbuf;
        uint16_t icxcon;
} IC, *PIC;

#define IC1 ACC1
extern volatile IC IC1 __attribute__((__sfr__));

#define IC1BUF IC1BUF
extern volatile uint16_t IC1BUF __attribute__((__sfr__));
#define IC1TMR IC1TMR
extern volatile uint16_t IC1TMR __attribute__((__sfr__));
#define IC2CON1 IC2CON1
extern volatile uint16_t IC2CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC2CON1BITS {
  union {
    struct {
      uint16_t ICM:3;
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICI:2;
      uint16_t :3;
      uint16_t ICTSEL:3;
      uint16_t ICSIDL:1;
    };
    struct {
      uint16_t ICM0:1;
      uint16_t ICM1:1;
      uint16_t ICM2:1;
      uint16_t :2;
      uint16_t ICI0:1;
      uint16_t ICI1:1;
      uint16_t :3;
      uint16_t ICTSEL0:1;
      uint16_t ICTSEL1:1;
      uint16_t ICTSEL2:1;
    };
  };
} IC2CON1BITS;
