MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB406/mcu.h
#define _CCP6CON2H_ICSEL2_POSITION               0x00000002
#define _CCP6CON2H_ICSEL2_MASK                   0x00000004
#define _CCP6CON2H_ICSEL2_LENGTH                 0x00000001

#define _CCP6CON3L_DT_POSITION                   0x00000000
#define _CCP6CON3L_DT_MASK                       0x0000003F
#define _CCP6CON3L_DT_LENGTH                     0x00000006

#define _CCP6CON3L_DT0_POSITION                  0x00000000
#define _CCP6CON3L_DT0_MASK                      0x00000001
#define _CCP6CON3L_DT0_LENGTH                    0x00000001

#define _CCP6CON3L_DT1_POSITION                  0x00000001
#define _CCP6CON3L_DT1_MASK                      0x00000002
#define _CCP6CON3L_DT1_LENGTH                    0x00000001

#define _CCP6CON3L_DT2_POSITION                  0x00000002
#define _CCP6CON3L_DT2_MASK                      0x00000004
#define _CCP6CON3L_DT2_LENGTH                    0x00000001

#define _CCP6CON3L_DT3_POSITION                  0x00000003
#define _CCP6CON3L_DT3_MASK                      0x00000008
#define _CCP6CON3L_DT3_LENGTH                    0x00000001

#define _CCP6CON3L_DT4_POSITION                  0x00000004
#define _CCP6CON3L_DT4_MASK                      0x00000010
#define _CCP6CON3L_DT4_LENGTH                    0x00000001

#define _CCP6CON3L_DT5_POSITION                  0x00000005
#define _CCP6CON3L_DT5_MASK                      0x00000020
#define _CCP6CON3L_DT5_LENGTH                    0x00000001

#define _CCP6CON3H_PSSACE_POSITION               0x00000002
#define _CCP6CON3H_PSSACE_MASK                   0x0000000C
#define _CCP6CON3H_PSSACE_LENGTH                 0x00000002

#define _CCP6CON3H_POLACE_POSITION               0x00000005
#define _CCP6CON3H_POLACE_MASK                   0x00000020
#define _CCP6CON3H_POLACE_LENGTH                 0x00000001

#define _CCP6CON3H_OUTM_POSITION                 0x00000008
#define _CCP6CON3H_OUTM_MASK                     0x00000700
#define _CCP6CON3H_OUTM_LENGTH                   0x00000003

#define _CCP6CON3H_OSCNT_POSITION                0x0000000C
#define _CCP6CON3H_OSCNT_MASK                    0x00007000
#define _CCP6CON3H_OSCNT_LENGTH                  0x00000003

#define _CCP6CON3H_OETRIG_POSITION               0x0000000F
#define _CCP6CON3H_OETRIG_MASK                   0x00008000
#define _CCP6CON3H_OETRIG_LENGTH                 0x00000001

#define _CCP6CON3H_PSSACE0_POSITION              0x00000002
#define _CCP6CON3H_PSSACE0_MASK                  0x00000004
#define _CCP6CON3H_PSSACE0_LENGTH                0x00000001

#define _CCP6CON3H_PSSACE1_POSITION              0x00000003
#define _CCP6CON3H_PSSACE1_MASK                  0x00000008
#define _CCP6CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP6CON3H_OUTM0_POSITION                0x00000008
#define _CCP6CON3H_OUTM0_MASK                    0x00000100
#define _CCP6CON3H_OUTM0_LENGTH                  0x00000001

#define _CCP6CON3H_OUTM1_POSITION                0x00000009
#define _CCP6CON3H_OUTM1_MASK                    0x00000200
#define _CCP6CON3H_OUTM1_LENGTH                  0x00000001

#define _CCP6CON3H_OUTM2_POSITION                0x0000000A
#define _CCP6CON3H_OUTM2_MASK                    0x00000400
#define _CCP6CON3H_OUTM2_LENGTH                  0x00000001

#define _CCP6CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP6CON3H_OSCNT0_MASK                   0x00001000
#define _CCP6CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP6CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP6CON3H_OSCNT1_MASK                   0x00002000
#define _CCP6CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP6CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP6CON3H_OSCNT2_MASK                   0x00004000
#define _CCP6CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP6STAT_ICBNE_POSITION                 0x00000000
#define _CCP6STAT_ICBNE_MASK                     0x00000001
#define _CCP6STAT_ICBNE_LENGTH                   0x00000001

#define _CCP6STAT_ICOV_POSITION                  0x00000001
#define _CCP6STAT_ICOV_MASK                      0x00000002
#define _CCP6STAT_ICOV_LENGTH                    0x00000001

#define _CCP6STAT_ICDIS_POSITION                 0x00000002
#define _CCP6STAT_ICDIS_MASK                     0x00000004
#define _CCP6STAT_ICDIS_LENGTH                   0x00000001

#define _CCP6STAT_SCEVT_POSITION                 0x00000003
#define _CCP6STAT_SCEVT_MASK                     0x00000008
#define _CCP6STAT_SCEVT_LENGTH                   0x00000001

#define _CCP6STAT_ASEVT_POSITION                 0x00000004
#define _CCP6STAT_ASEVT_MASK                     0x00000010
#define _CCP6STAT_ASEVT_LENGTH                   0x00000001

#define _CCP6STAT_TRCLR_POSITION                 0x00000005
#define _CCP6STAT_TRCLR_MASK                     0x00000020
#define _CCP6STAT_TRCLR_LENGTH                   0x00000001

#define _CCP6STAT_TRSET_POSITION                 0x00000006
#define _CCP6STAT_TRSET_MASK                     0x00000040
#define _CCP6STAT_TRSET_LENGTH                   0x00000001

#define _CCP6STAT_CCPTRIG_POSITION               0x00000007
#define _CCP6STAT_CCPTRIG_MASK                   0x00000080
#define _CCP6STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP6STAT_ICGARM_POSITION                0x0000000A
#define _CCP6STAT_ICGARM_MASK                    0x00000400
#define _CCP6STAT_ICGARM_LENGTH                  0x00000001

#define _CCP6STAT_TRIG_POSITION                  0x00000007
#define _CCP6STAT_TRIG_MASK                      0x00000080
#define _CCP6STAT_TRIG_LENGTH                    0x00000001

#define _CCP6STATL_ICBNE_POSITION                0x00000000
#define _CCP6STATL_ICBNE_MASK                    0x00000001
#define _CCP6STATL_ICBNE_LENGTH                  0x00000001

#define _CCP6STATL_ICOV_POSITION                 0x00000001
#define _CCP6STATL_ICOV_MASK                     0x00000002
#define _CCP6STATL_ICOV_LENGTH                   0x00000001

#define _CCP6STATL_ICDIS_POSITION                0x00000002
#define _CCP6STATL_ICDIS_MASK                    0x00000004
#define _CCP6STATL_ICDIS_LENGTH                  0x00000001

