MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB406/mcu.h
#define _IOCFH_IOCFH0_POSITION                   0x00000000
#define _IOCFH_IOCFH0_MASK                       0x00000001
#define _IOCFH_IOCFH0_LENGTH                     0x00000001

#define _IOCFH_IOCFH1_POSITION                   0x00000001
#define _IOCFH_IOCFH1_MASK                       0x00000002
#define _IOCFH_IOCFH1_LENGTH                     0x00000001

#define _IOCFH_IOCFH2_POSITION                   0x00000002
#define _IOCFH_IOCFH2_MASK                       0x00000004
#define _IOCFH_IOCFH2_LENGTH                     0x00000001

#define _IOCFH_IOCFH3_POSITION                   0x00000003
#define _IOCFH_IOCFH3_MASK                       0x00000008
#define _IOCFH_IOCFH3_LENGTH                     0x00000001

#define _IOCFH_IOCFH4_POSITION                   0x00000004
#define _IOCFH_IOCFH4_MASK                       0x00000010
#define _IOCFH_IOCFH4_LENGTH                     0x00000001

#define _IOCFH_IOCFH5_POSITION                   0x00000005
#define _IOCFH_IOCFH5_MASK                       0x00000020
#define _IOCFH_IOCFH5_LENGTH                     0x00000001

#define _IOCFH_IOCFH6_POSITION                   0x00000006
#define _IOCFH_IOCFH6_MASK                       0x00000040
#define _IOCFH_IOCFH6_LENGTH                     0x00000001

#define _IOCFH_IOCFH7_POSITION                   0x00000007
#define _IOCFH_IOCFH7_MASK                       0x00000080
#define _IOCFH_IOCFH7_LENGTH                     0x00000001

#define _IOCFH_IOCFH8_POSITION                   0x00000008
#define _IOCFH_IOCFH8_MASK                       0x00000100
#define _IOCFH_IOCFH8_LENGTH                     0x00000001

#define _IOCFH_IOCFH9_POSITION                   0x00000009
#define _IOCFH_IOCFH9_MASK                       0x00000200
#define _IOCFH_IOCFH9_LENGTH                     0x00000001

#define _IOCFH_IOCFH10_POSITION                  0x0000000A
#define _IOCFH_IOCFH10_MASK                      0x00000400
#define _IOCFH_IOCFH10_LENGTH                    0x00000001

#define _IOCFH_IOCFH11_POSITION                  0x0000000B
#define _IOCFH_IOCFH11_MASK                      0x00000800
#define _IOCFH_IOCFH11_LENGTH                    0x00000001

#define _IOCFH_IOCFH12_POSITION                  0x0000000C
#define _IOCFH_IOCFH12_MASK                      0x00001000
#define _IOCFH_IOCFH12_LENGTH                    0x00000001

#define _IOCFH_IOCFH13_POSITION                  0x0000000D
#define _IOCFH_IOCFH13_MASK                      0x00002000
#define _IOCFH_IOCFH13_LENGTH                    0x00000001

#define _IOCFH_IOCFH14_POSITION                  0x0000000E
#define _IOCFH_IOCFH14_MASK                      0x00004000
#define _IOCFH_IOCFH14_LENGTH                    0x00000001

#define _IOCFH_IOCFH15_POSITION                  0x0000000F
#define _IOCFH_IOCFH15_MASK                      0x00008000
#define _IOCFH_IOCFH15_LENGTH                    0x00000001

#define _CNPUH_IOCPH0_POSITION                   0x00000000
#define _CNPUH_IOCPH0_MASK                       0x00000001
#define _CNPUH_IOCPH0_LENGTH                     0x00000001

#define _CNPUH_IOCPH1_POSITION                   0x00000001
#define _CNPUH_IOCPH1_MASK                       0x00000002
#define _CNPUH_IOCPH1_LENGTH                     0x00000001

#define _CNPUH_IOCPH2_POSITION                   0x00000002
#define _CNPUH_IOCPH2_MASK                       0x00000004
#define _CNPUH_IOCPH2_LENGTH                     0x00000001

#define _CNPUH_IOCPH3_POSITION                   0x00000003
#define _CNPUH_IOCPH3_MASK                       0x00000008
#define _CNPUH_IOCPH3_LENGTH                     0x00000001

#define _CNPUH_IOCPH4_POSITION                   0x00000004
#define _CNPUH_IOCPH4_MASK                       0x00000010
#define _CNPUH_IOCPH4_LENGTH                     0x00000001

#define _CNPUH_IOCPH5_POSITION                   0x00000005
#define _CNPUH_IOCPH5_MASK                       0x00000020
#define _CNPUH_IOCPH5_LENGTH                     0x00000001

#define _CNPUH_IOCPH6_POSITION                   0x00000006
#define _CNPUH_IOCPH6_MASK                       0x00000040
#define _CNPUH_IOCPH6_LENGTH                     0x00000001

#define _CNPUH_IOCPH7_POSITION                   0x00000007
#define _CNPUH_IOCPH7_MASK                       0x00000080
#define _CNPUH_IOCPH7_LENGTH                     0x00000001

#define _CNPUH_IOCPH8_POSITION                   0x00000008
#define _CNPUH_IOCPH8_MASK                       0x00000100
#define _CNPUH_IOCPH8_LENGTH                     0x00000001

#define _CNPUH_IOCPH9_POSITION                   0x00000009
#define _CNPUH_IOCPH9_MASK                       0x00000200
#define _CNPUH_IOCPH9_LENGTH                     0x00000001

#define _CNPUH_IOCPH10_POSITION                  0x0000000A
#define _CNPUH_IOCPH10_MASK                      0x00000400
#define _CNPUH_IOCPH10_LENGTH                    0x00000001

#define _CNPUH_IOCPH11_POSITION                  0x0000000B
#define _CNPUH_IOCPH11_MASK                      0x00000800
#define _CNPUH_IOCPH11_LENGTH                    0x00000001

#define _CNPUH_IOCPH12_POSITION                  0x0000000C
#define _CNPUH_IOCPH12_MASK                      0x00001000
#define _CNPUH_IOCPH12_LENGTH                    0x00000001

#define _CNPUH_IOCPH13_POSITION                  0x0000000D
#define _CNPUH_IOCPH13_MASK                      0x00002000
#define _CNPUH_IOCPH13_LENGTH                    0x00000001

#define _CNPUH_IOCPH14_POSITION                  0x0000000E
#define _CNPUH_IOCPH14_MASK                      0x00004000
#define _CNPUH_IOCPH14_LENGTH                    0x00000001

#define _CNPUH_IOCPH15_POSITION                  0x0000000F
#define _CNPUH_IOCPH15_MASK                      0x00008000
#define _CNPUH_IOCPH15_LENGTH                    0x00000001

#define _CNPUH_IOCPUH0_POSITION                  0x00000000
#define _CNPUH_IOCPUH0_MASK                      0x00000001
#define _CNPUH_IOCPUH0_LENGTH                    0x00000001

#define _CNPUH_IOCPUH1_POSITION                  0x00000001
#define _CNPUH_IOCPUH1_MASK                      0x00000002
#define _CNPUH_IOCPUH1_LENGTH                    0x00000001

